       IDENTIFICATION                       DIVISION.
       PROGRAM-ID. ESTRUTURA.
       ENVIRONMENT                          DIVISION.
       DATA                                 DIVISION.
       PROCEDURE                            DIVISION.
           DISPLAY "ESTRUTURA".
           STOP RUN.